In [11]:
import pandas as pd
import numpy as np

In [12]:
html_start = """<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Companies</title>
    <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
    <script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" crossorigin="anonymous"></script>
 <style>
    body {
      background-color: rgb(41, 41, 46);
    }

    .links {
      text-decoration: none;
      color: rgb(135, 192, 241);
    }
  </style>
</head>
<body>
    <div class="container-fluid">
        <h1 class="px-3 py-2 text-center text-light">Companies</h1>"""

In [13]:
c = pd.read_csv('Companies_to_Look_For_P.csv')
c.dropna(inplace=True, thresh=5)

In [14]:
c["CTC"] = c["Salary"].apply(lambda x: float(x.split(" ")[0]))
c["Base Salary"] = c["Salary"].apply(lambda x: float(x.split(" ")[1]))

In [15]:
c.drop(columns=["Salary"], inplace=True)

In [16]:
c["Preference"] = c["Preference"].astype(int)
c["Positions"] = c["Positions"].astype(int)

In [17]:
c.sort_values(by=["Preference", "CTC", "Positions"], inplace=True, ascending=[True, False, False])

In [18]:
c.reset_index(inplace=True, drop=True)
c.set_index(np.arange(1, len(c) + 1), inplace=True)
c.head()

,Company,Designation,Profile,Location,Preference,Apllied,Current Status,Remarks,Positions,CTC,Base Salary
1,Javis,Machine Learning Engineer,Analyst,Bangalore Mumbai Gurgaon,1,NaN,NaN,NaN,2,36.0,20.0
2,PayU,Associate Data Scientist,Analyst,Bangalore Gurgaon,1,Y,Coding Test Done on 12 Oct,Applied;Coding Test on 12 Oct;,5,22.0,18.0
3,FourthFrontier,Data Scientist,Analyst,Bangalore,1,NaN,NaN,NaN,1,22.0,22.0
4,Javis,Data Engineer,Analyst,Bangalore Mumbai Gurgaon,2,NaN,NaN,NaN,2,36.0,20.0
5,Javis,SDE (Frontend),IT,Bangalore Mumbai Gurgaon,2,NaN,NaN,NaN,2,36.0,20.0

In [19]:
html_start+= c.to_html(classes='table table-striped table-hover table-bordered table-dark', index=True, justify='center', border=0, escape=False)
html_start = html_start.replace(""" style="text-align: right;">""", ">")
html_start = html_start.replace("""border="1" """, "")
html_start = html_start.replace("dataframe", "")
html_start+="</div></body></html>"

In [20]:
with open("index.html", "w") as f:
    f.write(html_start)